app/Http/Controllers/AuthController.php

insert into `users` (`name`, `password`, `updated_at`, `created_at`) values ('abcdefg', '$2y$10$Ay8EELp.uRFjO.Dqf643jOY9SdKjkqPe11S75CP52y0xPKj/w3n22', '2022-11-14 11:37:21', '2022-11-14 11:37:21')
insert into `user_roles` (`user_id`, `role_id`, `updated_at`, `created_at`) values (5, 1, '2022-11-14 11:37:21', '2022-11-14 11:37:21')
---
    public function customRegistration(Request $request): \Illuminate\Http\RedirectResponse
    {
        $request->validate([
            'name' => 'required|unique:users',
            'password' => 'required|min:6',
        ]);

        $user = new User();
        $user->name = $request->name;
        $user->password = Hash::make($request->password);
        $user->save();

        $userRoles = new userRoles();
        $userRoles->user_id = $user->id;
        $userRoles->role_id = $request->role ?? userRoles::user;
        $userRoles->save();