app/Http/Controllers/HomeController.php

    public function index()
    {
        $todo = Todo::with('user')->get();
---
select * from `todos`
select * from `users` where `users`.`id` in (2, 4, 5)