app/Http/Controllers/todoController.php

insert into `todos` (`user_id`, `taskName`, `taskDescription`, `startdate`, `enddate`, `done`, `updated_at`, `created_at`) values (5, 'Kanker', 'Kanker', '2022-11-29 00:00:00', '2022-11-30 00:00:00', 0, '2022-11-14 11:37:44', '2022-11-14 11:37:44')
update `todos` set `done` = 1, `todos`.`updated_at` = '2022-11-14 12:30:17' where `id` = '18'
---
    public function actions(Request $request)
    {
        if ($request->type == 'addPost') {
            $todo = new Todo;
            $todo->user_id = Auth()->id();
            $todo->taskName = $request->taskName;
            $todo->taskDescription = $request->taskDescription;
            $todo->startdate = $request->startDate;
            $todo->enddate = $request->endDate;
            $todo->done = 0;
            $todo->save();

            return $todo && response()->json($todo, 201);

        }

        if ($request->type == 'finishTodo') {
            Todo::where('id', $request->todoID)->update([
                'done' => 1
            ]);

update `todos` set `taskName` = 'Designing', `taskDescription` = 'Designer', `startdate` = '2022-11-29 01:00:00', `enddate` = '2022-11-30 01:00:00', `todos`.`updated_at` = '2022-11-14 12:27:25' where `id` = '18'
select * from `todos` where `id` = '18' limit 1
---
        }

        if($request->type == 'editCard') {
            Todo::where('id', $request->todoID)->update([
                'taskName' => $request->taskName,
                'taskDescription' => $request->taskDescription,
                'startdate' => Carbon::parse($request->startDate),
                'enddate' => Carbon::parse($request->endDate),
            ]);
        }
        if ($request->type == 'getCardInfo') {
            return Todo::where('id', $request->todoID)->firstOrFail();